	function Lipi_Badlen() {
      var Sabhi_Lipiyan = 12; // à¤‡à¤¸ à¤Ÿà¥‚à¤² à¤¸à¥‡ à¤¸à¤‚à¤¬à¤‚à¤§à¤¿à¤¤ à¤•à¥à¤² à¤²à¤¿à¤ªà¤¿à¤¯à¤¾à¤‚
      var Lipi_name = ["à¤¬à¤¾à¤‚à¤—à¥à¤²à¤¾", "à¤“à¤¡à¤¿à¤¯à¤¾", "à¤—à¥à¤°à¥à¤®à¥à¤–à¥€", "à¤—à¥à¤œà¤°à¤¾à¤¤à¥€", "à¤•à¤¨à¥à¤¨à¤¡", "à¤¤à¥‡à¤²à¥à¤—à¥", "à¤®à¤²à¤¯à¤¾à¤²à¤®", "à¤¤à¤®à¤¿à¤²", "à¤¸à¤¿à¤‚à¤¹à¤²", "à¤¤à¤¿à¤¬à¥à¤¬à¤¤à¥€", "à¤¥à¤¾à¤ˆ", "à¤¬à¤°à¥à¤®à¥€"]
      var Lipi = new Array(Sabhi_Lipiyan); // stores the conversion pairs
      // to store the number of charecters of each script found in the source text.
      var n_char = new Array(Sabhi_Lipiyan + 1);
      for (l_n = 0; l_n < Sabhi_Lipiyan + 1; l_n++) {
         n_char[l_n] = 0
      }
      var max_char_lipi_sankhya = 0;
      var n_char_max = 0; // max number of char found for any one script
      var l_n = 0; // counter to count scripts
      //== Lipi Conversion data =================
      // ===== Bangla Lipi =====
      Lipi[0] = ['à¦¯à¦¼', 'à¤¯', // two byte
            'à¦¬à¦¼', 'à¤°', // two byte
            'à¦¡à¦¼', 'à¥œ', //two byte
            'à¦¢à¦¼', 'à¥', //two byte
            'à¦•', 'à¤•', 'à¦–', 'à¤–', 'à¦—', 'à¤—', 'à¦˜', 'à¤˜', 'à¦™', 'à¤™', 'à¦š', 'à¤š', 'à¦›', 'à¤›', 'à¦œ', 'à¤œ', 'à¦', 'à¤', 'à¦ž', 'à¤ž', 'à¦Ÿ', 'à¤Ÿ', 'à¦ ', 'à¤ ', 'à¦¡', 'à¤¡', 'à§œ', 'à¥œ', 'à¦¢', 'à¤¢', 'à¦£', 'à¤£', 'à¦¤', 'à¤¤', 'à§Ž', 'à¤¤à¥', 'à¦¥', 'à¤¥', 'à¦¦', 'à¤¦', 'à¦§', 'à¤§', 'à¦¨', 'à¤¨', 'à¦ª', 'à¤ª', 'à¦«', 'à¤«', 'à¦¬', 'à¤¬', 'à¦­', 'à¤­', 'à¦®', 'à¤®', 'à¦¯', 'à¤¯', 'à§Ÿ', 'à¤¯', 'à¦°', 'à¤°', 'à¦²', 'à¤²', 'à¦¶', 'à¤¶', 'à¦·', 'à¤·', 'à¦¸', 'à¤¸', 'à¦¹', 'à¤¹', 'à¦•à§à¦·', 'à¤•à¥à¤·', 'à¦œà§à¦ž', 'à¤œà¥à¤ž', 'à§»', 'à¥¤', 'à§‡à¦¾', 'à¥‹', //This case is seen sometimes on BBC Bangla text. Though it is not as per Unicode norm.
            'à§‡à§—', 'à¥Œ', 'à§', 'à¥', 'à¦¾', 'à¤¾', 'à¦¿', 'à¤¿', 'à§€', 'à¥€', 'à§', 'à¥', 'à§‚', 'à¥‚', 'à§ƒ', 'à¥ƒ', 'à§‡', 'à¥‡', 'à§ˆ', 'à¥ˆ', 'à§‹', 'à¥‹', 'à§Œ', 'à¥Œ', 'à¦‚', 'à¤‚', 'à¦', 'à¤', 'à¦ƒ', 'à¤ƒ', 'à¦…', 'à¤…', 'à¦†', 'à¤†', 'à¦‡', 'à¤‡', 'à¦ˆ', 'à¤ˆ', 'à¦‰', 'à¤‰', 'à¦Š', 'à¤Š', 'à¦‹', 'à¤‹', 'à¦', 'à¤', 'à¦', 'à¤', 'à¦“', 'à¤“', 'à¦”', 'à¤”', 'à§¦', 'à¥¦', 'à§§', 'à¥§', 'à§¨', 'à¥¨', 'à§©', 'à¥©', 'à§ª', 'à¥ª', 'à§«', 'à¥«', 'à§¬', 'à¥¬', 'à§­', 'à¥­', 'à§®', 'à¥®', 'à§¯', 'à¥¯'
         ]
         // ====== Odiya Lipi ======
      Lipi[1] = ['à­œ', 'à¥œ', 'à­', 'à¥', 'à­Ÿ', 'à¤¯à¤¼', 'à¬•', 'à¤•', 'à¬–', 'à¤–', 'à¬—', 'à¤—', 'à¬˜', 'à¤˜', 'à¬™', 'à¤™', 'à¬š', 'à¤š', 'à¬›', 'à¤›', 'à¬œ', 'à¤œ', 'à¬', 'à¤', 'à¬ž', 'à¤ž', 'à¬Ÿ', 'à¤Ÿ', 'à¬ ', 'à¤ ', 'à¬¡', 'à¤¡', 'à¬¢', 'à¤¢', 'à¬£', 'à¤£', 'à¬¤', 'à¤¤', 'à¬¥', 'à¤¥', 'à¬¦', 'à¤¦', 'à¬§', 'à¤§', 'à¬¨', 'à¤¨', 'à¬ª', 'à¤ª', 'à¬«', 'à¤«', 'à¬¬', 'à¤¬', 'à¬­', 'à¤­', 'à¬®', 'à¤®', 'à¬¯', 'à¤¯', 'à¬°', 'à¤°', 'à¬²', 'à¤²', 'à¬³', 'à¤³', 'à­±', 'à¤µ', 'à¬¶', 'à¤¶', 'à¬·', 'à¤·', 'à¬¸', 'à¤¸', 'à¬¹', 'à¤¹',
            //--------------
            'à¬', 'à¤', 'à¬‚', 'à¤‚', 'à¬ƒ', 'à¤ƒ', 'à¬¼', 'à¤¼', 'à¬½', 'à¤½', 'à­', 'à¥', 'à¬…', 'à¤…', 'à¬†', 'à¤†', 'à¬¾', 'à¤¾', 'à¬‡', 'à¤‡', 'à¬¿', 'à¤¿', 'à¬ˆ', 'à¤ˆ', 'à­€', 'à¥€', 'à¬‰', 'à¤‰', 'à­', 'à¥', 'à¬Š', 'à¤Š', 'à­‚', 'à¥‚', 'à¬', 'à¤', 'à­‡', 'à¥‡', 'à¬', 'à¤', 'à­ˆ', 'à¥ˆ', 'à¬“', 'à¤“', 'à­‹', 'à¥‹', 'à¬”', 'à¤”', 'à­Œ', 'à¥Œ', 'à¬‹', 'à¤‹', 'à­ƒ', 'à¥ƒ', 'à­ ', 'à¥ ', 'à¬Œ', 'à¤Œ', 'à­¡', 'à¥¡', 'à­¦', 'à¥¦', 'à­§', 'à¥§', 'à­¨', 'à¥¨', 'à­©', 'à¥©', 'à­ª', 'à¥ª', 'à­«', 'à¥«', 'à­¬', 'à¥¬', 'à­­', 'à¥­', 'à­®', 'à¥®', 'à­¯', 'à¥¯'
         ]
         //===== Punjabi Lipi ======
      Lipi[2] = ['à¨•', 'à¤•', 'à¨–', 'à¤–', 'à¨—', 'à¤—', 'à¨˜', 'à¤˜', 'à¨™', 'à¤™', 'à¨š', 'à¤š', 'à¨›', 'à¤›', 'à¨œ', 'à¤œ', 'à¨', 'à¤', 'à¨ž', 'à¤ž', 'à¨Ÿ', 'à¤Ÿ', 'à¨ ', 'à¤ ', 'à¨¡', 'à¤¡', 'à¨¢', 'à¤¢', 'à¨£', 'à¤£', 'à¨¤', 'à¤¤', 'à¨¥', 'à¤¥', 'à¨¦', 'à¤¦', 'à¨§', 'à¤§', 'à¨¨', 'à¤¨', 'à¨ª', 'à¤ª', 'à¨«', 'à¤«', 'à¨¬', 'à¤¬', 'à¨­', 'à¤­', 'à¨®', 'à¤®', 'à¨¯', 'à¤¯', 'à¨°', 'à¤°', 'à¨²', 'à¤²', 'à¨µ', 'à¤µ', 'à¨¸à¨¼', 'à¤¶', 'à¨¶', 'à¤¶', 'à¨¸', 'à¤¸', 'à¨¹', 'à¤¹', 'à¨–à¨¼', 'à¥™', 'à©™', 'à¥™', 'à¨—à¨¼', 'à¥š', 'à©š', 'à¥š', 'à¨œà¨¼', 'à¥›', 'à©›', 'à¥›', 'à¨«à¨¼', 'à¥ž', 'à©ž', 'à¥ž', 'à¨²à¨¼', 'à¤²à¤¼', 'à¨³', 'à¤²à¤¼', 'à©œ', 'à¥œ', 'à¨¼', 'à¤¼', 'à©', 'à¥', 'à¨¾', 'à¤¾', 'à¨¿', 'à¤¿', 'à©€', 'à¥€', 'à©', 'à¥', 'à©‚', 'à¥‚', 'à©‡', 'à¥‡', 'à©ˆ', 'à¥ˆ', 'à©‹', 'à¥‹', 'à©Œ', 'à¥Œ', 'à¨‚', 'à¤‚', 'à©°', 'à¤‚', 'à¨…', 'à¤…', 'à¨†', 'à¤†', 'à¨‡', 'à¤‡', 'à¨ˆ', 'à¤ˆ', 'à¨‰', 'à¤‰', 'à¨Š', 'à¤Š', 'à¨', 'à¤', 'à¨', 'à¤', 'à¨“', 'à¤“', 'à¨”', 'à¤”', 'à©¦', 'à¥¦', 'à©§', 'à¥§', 'à©¨', 'à¥¨', 'à©©', 'à¥©', 'à©ª', 'à¥ª', 'à©«', 'à¥«', 'à©¬', 'à¥¬', 'à©­', 'à¥­', 'à©®', 'à¥®', 'à©¯', 'à¥¯']
         //====== Gujarati Lipi ======
      Lipi[3] = ['àª•', 'à¤•', 'àª–', 'à¤–', 'àª—', 'à¤—', 'àª˜', 'à¤˜', 'àª™', 'à¤™', 'àªš', 'à¤š', 'àª›', 'à¤›', 'àªœ', 'à¤œ', 'àª', 'à¤', 'àªž', 'à¤ž', 'àªŸ', 'à¤Ÿ', 'àª ', 'à¤ ', 'àª¡', 'à¤¡', 'àª¢', 'à¤¢', 'àª£', 'à¤£', 'àª¤', 'à¤¤', 'àª¥', 'à¤¥', 'àª¦', 'à¤¦', 'àª§', 'à¤§', 'àª¨', 'à¤¨', 'àªª', 'à¤ª', 'àª«', 'à¤«', 'àª¬', 'à¤¬', 'àª­', 'à¤­', 'àª®', 'à¤®', 'àª¯', 'à¤¯', 'àª°', 'à¤°', 'àª²', 'à¤²', 'àªµ', 'à¤µ', 'àª¶', 'à¤¶', 'àª·', 'à¤·', 'àª¸', 'à¤¸', 'àª¹', 'à¤¹', 'àª³', 'à¤³', 'àª•à«àª·', 'à¤•à¥à¤·', 'àªœà«àªž', 'à¤œà¥à¤ž', 'à«', 'à¥', 'àª¾', 'à¤¾', 'àª¿', 'à¤¿', 'à«€', 'à¥€', 'à«', 'à¥', 'à«‚', 'à¥‚', 'à«ƒ', 'à¥ƒ', 'à«‡', 'à¥‡', 'à«ˆ', 'à¥ˆ', 'à«‹', 'à¥‹', 'à«Œ', 'à¥Œ', 'à«…', 'à¥‰', 'à«‰', 'à¥‰', 'àª‚', 'à¤‚', 'àªƒ', 'à¤ƒ', 'àª…', 'à¤…', 'àª†', 'à¤†', 'àª‡', 'à¤‡', 'àªˆ', 'à¤ˆ', 'àª‰', 'à¤‰', 'àªŠ', 'à¤Š', 'àª‹', 'à¤‹', 'àª', 'à¤', 'àª', 'à¤', 'àª“', 'à¤“', 'àª”', 'à¤”', 'àª', 'à¤', 'àª‘', 'à¤‘', 'à«¦', 'à¥¦', 'à«§', 'à¥§', 'à«¨', 'à¥¨', 'à«©', 'à¥©', 'à«ª', 'à¥ª', 'à««', 'à¥«', 'à«¬', 'à¥¬', 'à«­', 'à¥­', 'à«®', 'à¥®', 'à«¯', 'à¥¯']
         //===== Kannada Lipi =========
      Lipi[4] = ["à²…", "à¤…", "à²†", "à¤†", "à²‡", "à¤‡", "à²ˆ", "à¤ˆ", "à²‰", "à¤‰", "à²Š", "à¤Š", "à²‹", "à¤‹", "à³ ", "à¥ ", "à²Œ", "à¤Œ", "à³¡", "à¥¡", "\u0C8E", 'à¤Ž', "à²", "à¤", "à²", "à¤", "\u0C92", 'à¤’', "à²“", "à¤“", "à²”", "à¤”", "à²•", "à¤•", "à²–", "à¤–", "à²—", "à¤—", "à²˜", "à¤˜", "à²™", "à¤™", "à²š", "à¤š", "à²›", "à¤›", "à²œ", "à¤œ", "à²", "à¤", "à²ž", "à¤ž", "à²Ÿ", "à¤Ÿ", "à² ", "à¤ ", "à²¡", "à¤¡", "à²¢", "à¤¢", "à²£", "à¤£", "à²¤", "à¤¤", "à²¥", "à¤¥", "à²¦", "à¤¦", "à²§", "à¤§", "à²¨", "à¤¨", "à²ª", "à¤ª", "à²«", "à¤«", "à²¬", "à¤¬", "à²­", "à¤­", "à²®", "à¤®", "à²¯", "à¤¯", "à²°", "à¤°", "à²²", "à¤²", "à²µ", "à¤µ", "à²¶", "à¤¶", "à²·", "à¤·", "à²¸", "à¤¸", "à²¹", "à¤¹", "à²³", "à¤³", "à¤«à¤¼", "à²«", "à²±", "à¤±", '\u0C82', 'à¤‚', '\u0C83', 'à¤ƒ', "\u0CBD", "à¤½", //awagraha
            '\u0CBE', 'à¤¾', '\u0CBF', 'à¤¿', '\u0CC0', 'à¥€', '\u0CC1', 'à¥', '\u0CC2', 'à¥‚', '\u0CC3', 'à¥ƒ', '\u0CC4', 'à¥ƒ', '\u0CC6', 'à¥†', '\u0CC7', 'à¥‡', '\u0CC8', 'à¥ˆ', '\u0CCA', 'à¥Š', '\u0CCB', 'à¥‹', '\u0CCC', 'à¥Œ', '\u0CCD', 'à¥', '\u0CDE', '\u095E', // à¤«à¤¼
            '\u0CE2', 'à¥¢', //lri
            '\u0CE3', 'à¥£', //lrii
            "à²“à²‚", "à¥", "à³¦", "à¥¦", "à³§", "à¥§", "à³¨", "à¥¨", "à³©", "à¥©", "à³ª", "à¥ª", "à³«", "à¥«", "à³¬", "à¥¬", "à³­", "à¥­", "à³®", "à¥®", "à³¯", "à¥¯"
         ]
         //====== Telugu Lipi ======
      Lipi[5] = ["à°…", "à¤…", "à°†", "à¤†", "à°‡", "à¤‡", "à°ˆ", "à¤ˆ", "à°‰", "à¤‰", "à°Š", "à¤Š", "à°‹", "à¤‹", "à± ", "à¥ ", "à°Œ", "à¤Œ", "à±¡", "à¥¡", "\u0C0E", "à¤Ž", "à°", "à¤", "à°", "à¤", "\u0C12", "à¤’", "à°“", "à¤“", "à°”", "à¤”", "à°•", "à¤•", "à°–", "à¤–", "à°—", "à¤—", "à°˜", "à¤˜", "à°™", "à¤™", "à°š", "à¤š", "à°›", "à¤›", "à°œ", "à¤œ", "à°", "à¤", "à°ž", "à¤ž", "à°Ÿ", "à¤Ÿ", "à° ", "à¤ ", "à°¡", "à¤¡", "à°¢", "à¤¢", "à°£", "à¤£", "à°¤", "à¤¤", "à°¥", "à¤¥", "à°¦", "à¤¦", "à°§", "à¤§", "à°¨", "à¤¨", "à°ª", "à¤ª", "à°«", "à¤«", "à°¬", "à¤¬", "à°­", "à¤­", "à°®", "à¤®", "à°¯", "à¤¯", "à°°", "à¤°", "à°²", "à¤²", "à°µ", "à¤µ", "à°¶", "à¤¶", "à°·", "à¤·", "à°¸", "à¤¸", "à°¹", "à¤¹", "à°³", "à¤³",
            //"à°•" , "à¤•à¤¼" ,
            //"à°–" , "à¤–à¤¼" ,
            "à°±", "à¤±", 'à±', 'à¥', 'à°¾', 'à¤¾', 'à°¿', 'à¤¿', 'à±€', 'à¥€', 'à±', 'à¥', 'à±‚', 'à¥‚', 'à±ƒ', 'à¥ƒ', 'à±„', 'à¥ƒ', '\u06C2', 'à¥¢', //lri
            '\u06C3', 'à¥£', //lrii
            'à±†', 'à¥†', 'à±‡', 'à¥‡', 'à±ˆ', 'à¥ˆ', 'à±Š', 'à¥Š', 'à±‹', 'à¥‹', 'à±Œ', 'à¥Œ', 'à°‚', 'à¤‚', 'à°ƒ', 'à¤ƒ', "à°", "à¤", "à°½", "à¤½", //awagraha
            "à±¦", "à¥¦", "à±§", "à¥§", "à±¨", "à¥¨", "à±©", "à¥©", "à±ª", "à¥ª", "à±«", "à¥«", "à±¬", "à¥¬", "à±­", "à¥­", "à±®", "à¥®", "à±¯", "à¥¯"
         ]
         //====== Malayalam Lipi =======
      Lipi[6] = [
            // 'â€' , '' ,  // NWJ charecter (left ); Not visible here.
            'à´•', 'à¤•', 'à´–', 'à¤–', 'à´—', 'à¤—', 'à´˜', 'à¤˜', 'à´™', 'à¤™', 'à´š', 'à¤š', 'à´›', 'à¤›', 'à´œ', 'à¤œ', 'à´', 'à¤', 'à´ž', 'à¤ž', 'à´Ÿ', 'à¤Ÿ', 'à´ ', 'à¤ ', 'à´¡', 'à¤¡', 'à´¢', 'à¤¢', 'à´£', 'à¤£', 'à´¤', 'à¤¤', 'à´¥', 'à¤¥', 'à´¦', 'à¤¦', 'à´§', 'à¤§', 'à´¨àµà´±àµ†', 'à¤¨à¥à¤Ÿà¥‡', 'à´¨', 'à¤¨',
            //'àµº' , 'à¤©' ,  // chillu NN // à¤¨à¥à¤¨à¤ // see below
            'à´ª', 'à¤ª', 'à´«', 'à¤«', 'à´¬', 'à¤¬', 'à´­', 'à¤­', 'à´®', 'à¤®', 'à´¯', 'à¤¯', 'à´°', 'à¤°', 'à´±à´±', 'à¤Ÿà¥à¤Ÿ', 'à´±àµà´±', 'à¤Ÿà¥à¤Ÿ', 'à´±', 'à¤±', 'à´²', 'à¤²', 'à´³', 'à¤³', 'à´´', 'à¤´', 'à´µ', 'à¤µ', 'à´¶', 'à¤¶', 'à´·', 'à¤·', 'à´¸', 'à¤¸', 'à´¹', 'à¤¹',
            // The six Chillus or chillaaxaram ; special consonant letters that represents a pure consonant independently, without help of a virama or halant. It is 'soft halant'.
            'àµº', 'à¤£à¥', //CHILLU NN á¹‡a à´£
            'àµ»', 'à¤¨à¥', //  Chillu-n ; but it is NOT exacty 'à¤¨à¥' 
            'àµ¼', 'à¤°à¥', //CHILLU RR ra à´° Historically from ra, not from á¹Ÿa (RRA) à´±.
            'àµ½', 'à¤²à¥', //CHILLU L ; la à´² ; Historically from ta à´¤.
            'àµ¾', 'à¤³à¥', //CHILLU LL á¸·a à´³  
            'àµ¿', 'à¤•à¥', //CHILLU K ka à´•
            'à´‚', 'à¤‚', 'à´ƒ', 'à¤ƒ', 'à´½', 'à¤½', //Avagraha called 'Praslesham' in Malayalam
            'à´¾', 'à¤¾', 'à´¿', 'à¤¿', 'àµ€', 'à¥€', 'àµ', 'à¥', 'àµ‚', 'à¥‚', 'àµƒ', 'à¥ƒ', 'àµ†', 'à¥†', 'àµ‡', 'à¥‡', 'àµˆ', 'à¥ˆ', 'àµŠ', 'à¥Š', 'àµ‹', 'à¥‹', 'àµŒ', 'à¥Œ', 'àµ—', 'à¥Œ', //Modern form
            'àµàµ', 'à¥', //half-u + chandrakalaa
            'àµ', 'à¥', //Chandrakalaa ; very short vovel if at the end of a word called 'saá¹vrÌ¥tÅkÄram'
            'àµ†', '\u0946', //short e maatraa
            'àµŠ', '\u094A', //short o maatraa
            'à´…', 'à¤…', 'à´†', 'à¤†', 'à´‡', 'à¤‡', 'à´ˆ', 'à¤ˆ', 'à´‰', 'à¤‰', 'à´Š', 'à¤Š', 'à´‹', 'à¤‹', 'à´Œ', 'à¤Œ', 'à´Ž', 'à¤Ž', 'à´', 'à¤', 'à´', 'à¤', 'à´’', 'à¤’', 'à´“', 'à¤“', 'à´”', 'à¤”', 'àµ ', 'à¥ ', 'àµ¡', 'à¥¡', 'àµ¢', 'à¥¢', // lri
            'àµ£', 'à¥£', //lrii
            'àµ¦', 'à¥¦', 'àµ§', 'à¥§', 'àµ¨', 'à¥¨', 'àµ©', 'à¥©', 'àµª', 'à¥ª', 'àµ«', 'à¥«', 'àµ¬', 'à¥¬', 'àµ­', 'à¥­', 'àµ®', 'à¥®', 'àµ¯', 'à¥¯'
         ]
         //===== Tamil Lipi =====
      Lipi[7] = ['à®…', 'à¤…', 'à®†', 'à¤†', 'à®‡', 'à¤‡', 'à®ˆ', 'à¤ˆ', 'à®‰', 'à¤‰', 'à®Š', 'à¤Š', 'à®Ž', 'à¤Ž', 'à®', 'à¤', 'à®', 'à¤', 'à®’', 'à¤’', 'à®“', 'à¤“', 'à®”', 'à¤”', 'à®‚', 'à¤‚', // added on 28-9-12 ; check if it is correct
            'à®¾', 'à¤¾', 'à®¿', 'à¤¿', 'à¯€', 'à¥€', 'à¯', 'à¥', 'à¯‚', 'à¥‚', 'à¯†', 'à¥†', 'à¯‡', 'à¥‡', 'à¯ˆ', 'à¥ˆ', 'à¯Š', 'à¥Š', 'à¯‹', 'à¥‹', 'à¯Œ', 'à¥Œ', 'à¯', 'à¥', 'à®ƒ', 'à¤•', // special Tamil semiconsonent charecter called ' Äytam ' .
            'à®•', 'à¤•', 'à®™', 'à¤™', 'à®š', 'à¤š', 'à®ž', 'à¤ž', 'à®Ÿ', 'à¤Ÿ', 'à®£', 'à¤£', 'à®¤', 'à¤¤', 'à®¨', 'à¤¨', 'à®ª', 'à¤ª', 'à®®', 'à¤®', 'à®¯', 'à¤¯', 'à®°', 'à¤°', 'à®²', 'à¤²', 'à®µ', 'à¤µ', 'à®´', 'à¤´', 'à®³', 'à¤³', 'à®±', 'à¤±', 'à®©', 'à¤©',
            //Grantha Lipi consonants adopted in tamil
            'à®¶', 'à¤¶', 'à®œ', 'à¤œ', 'à®·', 'à¤·', 'à®¸', 'à¤¸', 'à®¹', 'à¤¹', 'à®•à¯à®·', 'à¤•à¥à¤·',
            //'\u0BF3' , '0' ,
            'à¯¦', '0', 'à¯§', '1', 'à¯¨', '2', 'à¯©', '3', 'à¯ª', '4', 'à¯«', '5', 'à¯¬', '6', 'à¯­', '7', 'à¯®', '8', 'à¯¯', '9', 'à¯°', '10', 'à¯±', '100', 'à¯²', '1000'
         ]
         //===== Sinhala Lipi =====
      Lipi[8] = ['\u0D9A', 'à¤•', '\u0D9B', 'à¤–', '\u0D9C', 'à¤—', '\u0D9D', 'à¤˜', 'à¶ž', 'à¤™', 'à¶ ', 'à¤š', 'à¶¡', 'à¤›', 'à¶¢', 'à¤œ', 'à¶£', 'à¤', 'à¶¤', 'à¤ž', 'à¶§', 'à¤Ÿ', 'à¶¨', 'à¤ ', 'à¶©', 'à¤¡', 'à¶ª', 'à¤¢', 'à¶«', 'à¤£', 'à¶­', 'à¤¤', 'à¶®', 'à¤¥', 'à¶¯', 'à¤¦', 'à¶°', 'à¤§', 'à¶±', 'à¤¨', 'à¶´', 'à¤ª', 'à¶µ', 'à¤«', 'à¶¶', 'à¤¬', 'à¶·', 'à¤­', 'à¶¸', 'à¤®', '\u0DBA', 'à¤¯', '\u0DBB', 'à¤°', '\u0DBD', 'à¤²', '\u0DC0', 'à¤µ', '\u0DC1', 'à¤¶', '\u0DC2', 'à¤·', '\u0DC3', 'à¤¸', '\u0DC4', 'à¤¹', 'à·…', 'à¤³', '\u0DBB', 'à¥ž', "à¶¥", "à¤œà¥à¤ž", 'à·Š', 'à¥', 'à·', 'à¤¾', 'à·’', 'à¤¿', 'à·“', 'à¥€', 'à·”', 'à¥', 'à·–', 'à¥‚', 'à·˜', 'à¥ƒ', 'à·²', 'à¥„', 'à·™', 'à¥†', 'à·š', 'à¥‡', 'à·›', 'à¥ˆ', 'à·œ', 'à¥Š', 'à·', 'à¥‹', 'à·ž', 'à¥Œ', 'à¶‚', 'à¤‚', 'à¶ƒ', 'à¤ƒ', 'à¶…', 'à¤…', 'à¶†', 'à¤†', 'à¶‰', 'à¤‡', 'à¶Š', 'à¤ˆ', 'à¶‹', 'à¤‰', 'à¶Œ', 'à¤Š', 'à¶', 'à¤‹', 'à¶', 'à¤Œ', 'à¶‘', 'à¤Ž', 'à¶’', 'à¤', 'à¶“', 'à¤', 'à¶”', 'à¤’', 'à¶•', 'à¤“', 'à¶–', 'à¤”', 'à¶Ÿ', 'à¤™à¥à¤—', 'à¶¬', 'à¤£à¥à¤¡', 'à¶³', 'à¤¨à¥à¤¦', 'à¶¹', 'à¤®à¥à¤¬', 'à¶‡', 'à¤', 'à·', 'à¥…', 'à¶ˆ', 'à¤', 'à·‘', 'à¥ˆ', '\u0DD0', 'à¥§', '\u0DD1', 'à¥¨', '\u0DD2', 'à¥©', '\u0DD3', 'à¥ª', '\u0DD4', 'à¥«', '\u0DD5', 'à¥¬', '\u0DD6', 'à¥­', '\u0DD7', 'à¥®', '\u0DD8', 'à¥¯']
         //====== Tibetan Lipi =======
      Lipi[9] = ['\u0F00', 'à¥', '\u0F0D', 'à¥¤', '\u0F0E', 'à¥¥', '\u0F14', '\,', 'à½¨', 'à¤…', 'à½¨à½±', 'à¤†', 'à½¨à½²', 'à¤‡', 'à½¨à½±à½²', 'à¤ˆ', 'à½¨à½´', 'à¤‰', 'à½¨à½±à½´', 'à¤Š', 'à½¨à½º', 'à¤', 'à½¨à½»', 'à¤', 'à½¨à½¼', 'à¤“', 'à½¨à½½', 'à¤”', 'à½¢à¾€', 'à¤‹', 'à½¢à½±à¾€', 'à¥ ', 'à½£à¾€', 'à¤Œ', 'à½£à½±à¾€', 'à¥¡', 'à½¨à½¾', 'à¤…à¤‚', 'à½¨à¾ƒ', 'à¤…à¤', 'à½¨à½¿', 'à¤…à¤ƒ',
            // halanta  or viraam ,
            '\u0F84', 'à¥', 'à½±', 'à¤¾', 'à½²', 'à¤¿', 'à½³', 'à¥€', 'à½´', 'à¥', 'à½µ', 'à¥‚', 'à½º', 'à¥‡', 'à½»', 'à¥ˆ', 'à½¼', 'à¥‹', 'à½½', 'à¥Œ', 'à½¶', 'à¥ƒ', 'à½·', 'à¥ ', 'à½¸', 'à¤Œ', 'à½¹', 'à¥¡', 'à½¾', 'à¤‚', 'à¾ƒ', 'à¤', 'à½¿', 'à¤ƒ', 'à½€', 'à¤•', 'à½', 'à¤–', 'à½‚', 'à¤—', '\u0F43', 'à¤˜', 'à½‚à¾·', 'à¤˜', //ga+ha
            'à½„', 'à¤™', 'à½™', 'à¤š', // 0F59
            'à½š', 'à¤›', // 0F5A
            'à½›', 'à¤œ', // 0F5B
            'à½›à¾·', 'à¤', //ja+ha
            '\u0F5C', 'à¤', '\u0F45', 'à¤š', '\u0F46', 'à¤›', '\u0F47', 'à¤œ', '\u0F47' + '\u0FB7', 'à¤', 'à½‰', 'à¤ž', 'à½Š', 'à¤Ÿ', 'à½‹', 'à¤ ', 'à½Œ', 'à¤¡', 'à½Œà¾·', 'à¤¢', '\u0F4D', 'à¤¢', 'à½Ž', 'à¤£', 'à½', 'à¤¤', 'à½', 'à¤¥', 'à½‘', 'à¤¦', 'à½‘à¾·', 'à¤§', '\u0F52', 'à¤§', 'à½“', 'à¤¨', 'à½”', 'à¤ª', 'à½•', 'à¤«', 'à½–', 'à¤¬', '\u0F57', 'à¤­', 'à½˜', 'à¤®', 'à½¡', 'à¤¯', 'à½¢', 'à¤°', 'à½£', 'à¤²', 'à½', 'à¤µ', 'à½¤', 'à¤¶', 'à½¥', 'à¤·', 'à½¦', 'à¤¸', 'à½§', 'à¤¹', 'à½€à¾µ', 'à¤•à¥à¤·',
            //TIBETAN LETTER -A or 'a transliterted as v ; confirm this. ,
            '\u0F60', 'à¤µ', '\u0F5E', 'à¤', '\u0F5F', 'à¤œ',
            //Tibetan Subjoined charecters follow here- ,
            '\u0F90', 'à¥à¤•', '\u0F91', 'à¥à¤–', '\u0F92', 'à¥à¤—', '\u0F93', 'à¥à¤˜', '\u0F94', 'à¥à¤™', '\u0F95', 'à¥à¤š', '\u0F96', 'à¥à¤›', '\u0F97', 'à¥à¤œ', '\u0F99', 'à¥à¤ž', '\u0F9A', 'à¥à¤Ÿ', '\u0F9B', 'à¥à¤ ', '\u0F9C', 'à¥à¤¡', '\u0F9D', 'à¥à¤¢', '\u0F9E', 'à¥à¤£', '\u0F9F', 'à¥à¤¤', '\u0FA0', 'à¥à¤¥', '\u0FA1', 'à¥à¤¦', '\u0FA2', 'à¥à¤§', '\u0FA3', 'à¥à¤¨', '\u0FA4', 'à¥à¤ª', '\u0FA5', 'à¥à¤«', '\u0FA6', 'à¥à¤¬', '\u0FA7', 'à¥à¤­', '\u0FA8', 'à¤®', '\u0FA9', 'à¥à¤š', '\u0FAA', 'à¥à¤›', '\u0FAB', 'à¥à¤œ', '\u0FAC', 'à¥à¤', '\u0FAD', 'à¥à¤µ', '\u0FAE', 'à¥à¤', '\u0FAF', 'à¥à¤œ', '\u0FB1', 'à¥à¤¯', '\u0FB2', 'à¥à¤°', '\u0FB3', 'à¥à¤²', '\u0FB4', 'à¥à¤¶', '\u0FB5', 'à¥à¤·', '\u0FB6', 'à¥à¤¸', '\u0FB7', 'à¥à¤¹', '\u0F20', 'à¥¦', '\u0F21', 'à¥§', '\u0F22', 'à¥¨', '\u0F23', 'à¥©', '\u0F24', 'à¥ª', '\u0F25', 'à¥«', '\u0F26', 'à¥¬', '\u0F27', 'à¥­', '\u0F28', 'à¥®', '\u0F29', 'à¥¯',
            //Tibetan digit minus half
            '\u0F2A', '0.5', '\u0F2B', '1.5', '\u0F2C', '2.5', '\u0F2D', '3.5', '\u0F2E', '4.5', '\u0F2F', '5.5', '\u0F30', '6.5', '\u0F31', '7.5', '\u0F32', '8.5', '\u0F33', '-0.5'
         ]
         //===== Thai Lipi =====
      Lipi[10] = [
            // Independent swar are not used in Thai except for 'à¸­'='à¤…' which is used only at initial letter of a syllable.
            'à¸¯', 'à¥¤',
            //'à¸­à¸°' , 'à¤…' ,
            'à¸­à¸²', 'à¤†', 'à¸­à¸´', 'à¤‡', 'à¸­à¸µ', 'à¤ˆ', 'à¸­à¸¸', 'à¤‰', 'à¸­à¸¹', 'à¤Š', 'à¸­à¹€', 'à¤', 'à¸­à¹‚', 'à¤“', ' à¸­', ' à¤…', //04-02-16
            'à¸º', 'à¥', //used to make 'half' letters in Sanskrit. Thai does not have the concept of conjunct consonants.
            'à¸°', '', // used to supress inherent o of the consonent 
            // following will NOT work in reverse mode-->?? find out if these lines are needed and are correct?
            'à¥‡à¸°', 'à¥‡', // à¸¥ à¸­ à¸™ à¸” à¸­ à¸™
            'à¥‡à¸¢', 'à¤¯', //u in "burn" + y in "boy"
            'à¥‡à¸­à¸°', '', // e in 'the'
            'à¥‡à¸­', '', // u in burn 
            'à¥‡à¸´', '', // e in 'the'
            'à¥‡à¸§', 'à¥‡à¤µ', 'à¥‡à¸²à¸°', 'à¥‰', // o in not
            'à¥‡à¸²', 'à¤¾à¤‰', // ow in cow
            'à¥‡à¸µà¸¢à¸°', 'à¥€à¤…', // ea in ear with glottal stop
            'à¥‡à¸µà¸¢à¸§', 'à¤¾à¤¯à¥‹', // io in "trio"
            'à¥‡à¸µà¸¢', 'à¥€à¤…', // ea in ear
            'à¥‡à¸·à¸­à¸°', 'à¥à¤¯à¥‹à¤°', // ure in "pure"
            'à¥‡à¸·à¸­', 'à¥à¤¯à¥‹à¤°', // ure in "pure"  à¸™à¸±à¹‰
            'à¹à¸°', 'à¥ˆ', //a in "at"
            'à¹à¹‡', 'à¥ˆ', //a in "at"  ;  note that à¹â€“à¹‡  the other maatraa is invisible in 'à¹à¹‡'
            'à¹', 'à¥ˆ', //a in "at"
            'à¹à¸§', 'à¥ˆà¤µà¥‹', //a in "ham" + ow in "low"
            // following will NOT work in reverse mode
            'à¥‹à¸°', 'à¥‹', 'à¸£à¸£à¸¡', 'à¤®à¥', //ro han with mo ma as closing consonant;É‘m am um ; um in "hum"; same as -à¸³
            'à¸£à¸£ ', 'à¤¨à¥ ', // ro han;an un; un in tun; same as -à¸±à¸™
            'à¸£à¸£', '', // ro han ;a u u in "nut"; same as -à¸±-
            'à¸²à¸§', 'à¤¾à¤‰', // sara a with wo waen as closing consonant; ow in "now"
            'à¸³', 'à¤‚', // sara am ; am, um ; um in "sum"
            'à¸²', 'à¤¾', //sara a ; a ah, ar, aa ;a in "father"
            'à¸±à¸§à¸°', 'à¥€à¤µ', // sara ua ; ewe in "sewer"
            'à¸±à¸§', 'à¥€à¤µ', //sara ua ; ewe in "newer"
            'à¸§à¸¢', 'à¥‰à¤¯', //sara ua with yo yak as closing consonant; uoy in "buoy"
            //'à¸§' , 'à¥€à¤µ' , //sara ua ; ewe in "newer"
            'à¸­à¸¢', 'à¥‰à¤¯', //sara o with yo yak as closing consonant; oy in "boy"
            'à¸­', 'à¤¾', // sara o;  aw in "saw"
            'à¸±à¸¢', 'à¤¾à¤¯', // sara a with yo yak as closing consonant; i in "hi" 
            'à¸±', '', // sara a in mai han-akat form;a a u ;u in "nut"
            'à¸°', '', // sara a ; aÊ” a u ; u in "nut"
            'à¸¶', 'à¥', // sara ue ; ue eu, u, uh; u in French "du" (short)
            'à¸·', 'à¥‚', //sara ue ; ue eu, u ; u in French "dur" (long)
            'à¹', 'à¤‚', 'à¸²', 'à¤¾', 'à¸´à¸§', 'à¤¿à¤‰', // sara i with wo waen as closing consonant; ew in "new"
            'à¸´', 'à¤¿', 'à¸µ', 'à¥€', //
            'à¸¸', 'à¥', //
            'à¸¹', 'à¥‚', //
            'à¹€', 'à¥‡', 'à¹‚', 'à¥‹', 'à¹„', 'à¤¾à¤‡', //  like i in "I"
            'à¹ƒ', 'à¥ˆ', 'à¸¤à¹…', 'à¥„', 'à¸¤', 'à¥ƒ', 'à¸¦à¹…', 'à¥£', 'à¸¦', 'à¥¢',
            //-------
            'à¸', 'à¤•', 'à¸‚', 'à¤–', 'à¸ƒ', 'à¤–', 'à¸„', 'à¤—', 'à¸…', 'à¤–', 'à¸†', 'à¤˜', 'à¸‡', 'à¤™', 'à¸Š', 'à¤œ', // ja? // changed to ja 4-2-16
            'à¸‰', 'à¤›', 'à¸ˆ', 'à¤œ', //ch? 
            'à¸‹', 'à¤¸', 'à¸Œ', 'à¤œ', 'à¸', 'à¤ž', 'à¸Ž', 'à¤Ÿ', // ?à¤¡  // changed to Ta 4-2-16
            'à¸', 'à¤Ÿ', 'à¸', 'à¤ ', 'à¸‘', 'à¤¡', 'à¸’', 'à¤¢', 'à¸“', 'à¤£', 'à¸”', 'à¤¦', //?à¤¡
            'à¸•', 'à¤¤', 'à¸–', 'à¤¥', 'à¸—', 'à¤¦', // 'à¤¦' , changed to da 4-2-16
            'à¸˜', 'à¤§', 'à¸™', 'à¤¨', 'à¸š', 'à¤¬', 'à¸›', 'à¤ª', 'à¸œ', 'à¤«', 'à¸', 'à¤«', 'à¸ž', 'à¤¬', 'à¸Ÿ', 'à¤«', 'à¸ ', 'à¤­', 'à¸¡', 'à¤®', 'à¸¢', 'à¤¯', 'à¸£', 'à¤°', 'à¸¥', 'à¤²', 'à¸§', 'à¤µ', 'à¸¨', 'à¤¶', 'à¸©', 'à¤·', 'à¸ª', 'à¤¸', 'à¸«', 'à¤¹', //à¤ƒ at the end?
            'à¸¬', 'à¤²', 'à¸®', 'à¤¹',
            //--------
            'à¹', 'à¥¦', 'à¹‘', 'à¥§', 'à¹’', 'à¥¨', 'à¹“', 'à¥©', 'à¹”', 'à¥ª', 'à¹•', 'à¥«', 'à¹–', 'à¥¬', 'à¹—', 'à¥­', 'à¹˜', 'à¥®', 'à¹™', 'à¥¯'
         ]
         //====== Burmese Lipi ======
      Lipi[11] = ['á€€', 'à¤•', 'á€', 'à¤–', 'á€‚', 'à¤—', 'á€ƒ', 'à¤˜', '\u1004' + '\u103A' + '\u1039', 'à¤™à¥', // nga + asat + viraam = kinzi
            'á€„', 'à¤™', 'á€…', 'à¤š', 'á€†', 'à¤›', 'á€‡', 'à¤œ', 'á€ˆ', 'à¤', 'á€‰', 'à¤ž', 'á€Š', 'à¤žà¥à¤ž', //NNYA
            'á€‹', 'à¤Ÿ', 'á€Œ', 'à¤ ', 'á€', 'à¤¡', 'á€Ž', 'à¤¢', 'á€', 'à¤£', 'á€', 'à¤¤', 'á€‘', 'à¤¥', 'á€’', 'à¤¦', 'á€“', 'à¤§', 'á€”', 'à¤¨', 'á€•', 'à¤ª', 'á€–', 'à¤«', 'á€—á€½', 'à¤µ', 'á€—', 'à¤¬', 'á€˜', 'à¤­', 'á€™', 'à¤®', 'á€š', 'à¤¯', 'á€›', 'à¤°', 'á€œ', 'à¤²', 'á€', 'à¤µ', 'á€ž', 'à¤¸', 'á€Ÿ', 'à¤¹', 'á€ ', 'à¤³',
            // following are extensions for Sanskrit/Pali
            '\u1050', 'à¤·', '\u1051', 'à¤¶', '\u1052', 'à¤‹', '\u1053', 'à¥ ', //RR
            '\u1054', 'à¤Œ', '\u1055', 'à¥¡', // deergh
            '\u1056', 'à¥ƒ', '\u1057', 'à¥„', // vowel sign RR
            '\u1058', 'à¥¢', // harswa LRi vovel sign
            '\u1059', 'à¥£', // deergh LRRII vovel sign
            // dependent consonants
            '\u103B', 'à¥à¤¯', '\u103C', 'à¥à¤°', '\u103D', 'à¥à¤µ', '\u103E', 'à¥à¤¹', '\u103F', 'à¤¸à¥à¤¸', // Great SA
            // composite independent vovels
            '\u1021' + 'á€­', 'à¤‡', '\u1021' + 'á€®', 'à¤ˆ', '\u1021' + 'á€¯', 'à¤‰', '\u1021' + 'á€°', 'à¤Š', '\u1021' + 'á€±' + 'á€¬' + 'á€º', 'à¤”', // a + e + aa + asat
            '\u1021' + 'á€±' + 'á€¬', 'à¤“',
            //'\u1021' + 'á€±' + 'á€·' , 'à¤' ,
            '\u1021' + 'á€±', 'à¤', '\u1021' + '\u102C', 'à¤†', '\u1022' + '\u102B', 'à¤†', // Shan A + tall aa
            '\u1021', 'à¤…', '\u1022', 'à¤…', // SHAN A
            'à¶†', 'à¤†', 'á€£', 'à¤‡', 'á€¤', 'à¤ˆ', '\u1025' + '\u102E', 'à¤Š', 'á€¥', 'à¤‰', 'á€¦', 'à¤Š', 'á€§', 'à¤', '\u1028', 'à¤', // MON E
            //'á€¨' , 'à¤' ,
            '\u1029', 'à¤“', '\u102A', 'à¤”', 'á€±' + 'á€«' + 'á€º', 'à¥Œ', // e + tall aa + asat
            '\u1031' + '\u102C' + '\u103A', 'à¥Œ', // e + aa + asat
            '\u102D' + '\u102F', 'à¥‹', // composite 'o' maatraa = vowel sign i + vowel sign u
            '\u1031' + '\u102C', 'à¥‹', // composite 'o' maatraa = e + aa
            '\u1031' + '\u102B', 'à¥‹', // e + tall aa
            '\u102B', 'à¤¾', // Vovel sign 'tall aa'
            'á€¬', 'à¤¾', // \u102C
            'á€­', 'à¤¿', 'á€®', 'à¥€', 'á€¯', 'à¥', 'á€°', 'à¥‚', 'á€±', 'à¥‡', // e kii maatraa left waalii
            '\u1035', 'à¥‡', // e kii matraa upar waalii
            'á€²', 'à¥ˆ', '\u1034', 'à¥‹', // MON 'o'
            // 'à·œ' , 'à¥‹' ,    // is this correct?
            'á€¶', 'à¤‚', // \u1036 anunaasika or chandrabindu // changed à¤  to à¤‚ on basis of comparision of Tripitaka in Devanagari and Burmese.
            'á€·', 'à¤‚', // \u1037 anuswara atonal mark (=aukmyit) 
            'á€¸', 'à¤ƒ', // \u1038 visarga
            '\u1033', 'à¥€', // MON ii
            '\u1034', 'à¥‹', // MON o
            // 'á€ºá€¹' , 'à¥' ,  // asata+viraama (ie kanzi)
            'á€¹', 'à¥', // \u1039 viraam
            'á€º', 'à¥', // \u103A asat
            '\u104A', 'à¥¤', // little section
            '\u104B', 'à¥¤', // section  // changed à¥¥ to à¥¤ on the basis of comparision of tripital in Devanagari and Burmese.
            '\u1040', 'à¥¦', '\u1041', 'à¥§', '\u1042', 'à¥¨', '\u1043', 'à¥©', '\u1044', 'à¥ª', '\u1045', 'à¥«', '\u1046', 'à¥¬', '\u1047', 'à¥­', '\u1048', 'à¥®', '\u1049', 'à¥¯'
         ]
         //===============================================
      var modified_substring = document.getElementById("Source_Script").value;
      //04-2-2016 : These 3 lines for Thai Script (to shift 5 matraas to right side.)
      modified_substring = modified_substring.replace(/([à¹€à¹à¹‚à¹ƒà¹„])([^\s\n])/g, "$2$1");
      modified_substring = modified_substring.replace(/([à¹€à¹à¹‚à¹ƒà¹„])([à¸º][^\s\n])/g, "$2$1");
      document.getElementById("Source_Script").value = modified_substring;
      document.getElementById("Target_Script").value = "Conversion in progress..";
      //****************************************************
      //  Break the long text into small bunches of chunk_size  characters each.
      //****************************************************
      var text_size = modified_substring.length;
      var processed_text = ''; //blank
      var sthiti1 = 0;
      var sthiti2 = 0;
      var chale_chalo = 1;
      var chunk_size = 6000; // this charecter long text will be processed in one go.
      while (chale_chalo == 1) {
         sthiti1 = sthiti2;
         if (sthiti2 < (text_size - chunk_size)) {
            sthiti2 += chunk_size;
            //      while (document.getElementById("Source_Script").value.charAt ( sthiti2 ) != ' ') {sthiti2--;} 
            //This was making problem if there is no 'space' in the whole document.
         } else {
            sthiti2 = text_size;
            chale_chalo = 0
         }
         var modified_substring = document.getElementById("Source_Script").value.substring(sthiti1, sthiti2);
         Replace_Symbols();
         var processed_text = processed_text + modified_substring;
         document.getElementById("Target_Script").value = "Conversion in progress.." + '\n\n' + 'Conversion of ' + sthiti2 + ' charecters out of ' + text_size + ' completed.';
      }
      // document.getElementById("Target_Script").value = processed_text ;	
      var transliterated_scripts = '';
      for (l_n = 0; l_n < Sabhi_Lipiyan - 1; l_n++) {
         transliterated_scripts = transliterated_scripts + Lipi_name[l_n] + '\, '
      };
      var output_script_number = document.getElementById("selected_output_script").selectedIndex;
      if (output_script_number == 0) document.getElementById("Target_Script").value = processed_text;
      else {
         convert_to_selected_script();
         document.getElementById("Target_Script").value = processed_text;
      }
      // ------------------------------------
      function Replace_Symbols() {
            //substitute array_two elements in place of corresponding array_one elements
            if (modified_substring != "") // if stringto be converted is non-blank then no need of any processing.
            {
               for (l_n = 0; l_n < Sabhi_Lipiyan; l_n++) // take each Script one by one
               {
                  for (input_symbol_idx = 0; input_symbol_idx < Lipi[l_n].length; input_symbol_idx = input_symbol_idx + 2) // Take each symbol of the script one by one
                  {
                     idx = modified_substring.indexOf(Lipi[l_n][input_symbol_idx])
                     while (idx != -1) //whie-00
                     {
                        modified_substring = modified_substring.replace(Lipi[l_n][input_symbol_idx], Lipi[l_n][input_symbol_idx + 1]);
                        n_char[l_n] ++;
                        idx = modified_substring.indexOf(Lipi[l_n][input_symbol_idx])
                     } // end of while-00 loop
                  } // end of inner for_loop
                  if (n_char[l_n] > n_char_max) {
                     n_char_max = n_char[l_n];
                     max_char_lipi_sankhya = l_n
                  };
               } // end of outer for_loop
            } // end of IF  statement  meant to  supress processing of  blank  string.
         } // end of the function  Replace_Symbols
      function convert_to_selected_script() {
            // document.getElementById("Text_Box_two").value = "à¤²à¤¿à¤ªà¤¿ à¤ªà¤°à¤¿à¤µà¤°à¥à¤¤à¤¨ à¤•à¤¾ à¤•à¤¾à¤°à¥à¤¯ à¤†à¤°à¤®à¥à¤­ à¤¹à¥‹ à¤—à¤¯à¤¾ à¤¹à¥ˆà¥¤ à¤•à¥à¤› à¤•à¥à¤·à¤£ à¤ªà¥à¤°à¤¤à¥€à¤•à¥à¤·à¤¾ à¤•à¥€à¤œà¤¿à¤¯à¥‡..."  ;  
            var modified_substring = processed_text;
            //********************************************************************************
            //  Break the long text into small bunches of max. max_text_size  characters each.
            //********************************************************************************
            var text_converted_into_devanagari = processed_text;
            var text_size = text_converted_into_devanagari.length;
            processed_text = ''; //blank
            var sthiti1 = 0;
            var sthiti2 = 0;
            var chale_chalo = 1;
            var max_text_size = 6000;
            while (chale_chalo == 1) {
               sthiti1 = sthiti2;
               if (sthiti2 < (text_size - max_text_size)) {
                  sthiti2 += max_text_size;
                  while (text_converted_into_devanagari.charAt(sthiti2) != ' ') {
                     sthiti2--;
                  }
               } else {
                  sthiti2 = text_size;
                  chale_chalo = 0
               }
               modified_substring = text_converted_into_devanagari.substring(sthiti1, sthiti2);
               Replace_Symbols();
               processed_text = processed_text + modified_substring;
               //  Breaking part code over
               //	  document.getElementById("Text_Box_two").value = processed_text  ;
            }
            // ----------------------------------------------------
            function Replace_Symbols() // for script conversion
               {
                  var array_one_length = Lipi[output_script_number - 1].length;
                  if (modified_substring != "") // if string to be converted is non-blank then no need of any processing.
                  {
                     for (input_symbol_idx = 1; input_symbol_idx < array_one_length; input_symbol_idx = input_symbol_idx + 2)
                        if (Lipi[output_script_number - 1][input_symbol_idx] != "") {
                           {
                              indx = 0; // index of the symbol being searched for replacement
                              while (indx != -1) //whie-00
                              {
                                 modified_substring = modified_substring.replace(Lipi[output_script_number - 1][input_symbol_idx], Lipi[output_script_number - 1][input_symbol_idx - 1])
                                 indx = modified_substring.indexOf(Lipi[output_script_number - 1][input_symbol_idx])
                              } // end of while-00 loop
                           } // if loop
                        } // end of for loop
                  }
               } // End of function Replace_Symbols( )
         } // end of convert_to_selected_script ()   
   } // end of Indian_Script_to_Devanagari function
   //*******************************************************************************
